src/Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИнтеграцияИСУНФВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ВидыПродукцииВЗапасах(Знач Запасы) Экспорт
	
	Возврат ИнтеграцияИСУНФ.ВидыПродукцииВЗапасах(Запасы);
	
КонецФункции

Функция ЗаполнитьРеквизитВидПродукцииИС() Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Номенклатура");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.ТабачнаяПродукция КАК ТабачнаяПродукция,
		|	Номенклатура.ОбувнаяПродукция КАК ОбувнаяПродукция,
		|	Номенклатура.ШиныИПокрышки КАК ШиныИПокрышки,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(Номенклатура.ТабачнаяПродукция
		|			ИЛИ Номенклатура.ОбувнаяПродукция
		|			ИЛИ Номенклатура.ШиныИПокрышки)
		|	И Номенклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		
		Если РезультатЗапроса.Пустой() Тогда
			Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Установить(Истина);
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если Выборка.ТабачнаяПродукция Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Табак;
				ИначеЕсли Выборка.ОбувнаяПродукция Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Обувь;
				ИначеЕсли Выборка.ШиныИПокрышки Тогда
					СправочникОбъект.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Шины;
					// отключаем механизм маркировки шин и покрышек в УНФ
					СправочникОбъект.ШиныИПокрышки = Ложь;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			КонецЦикла;
			
		КонецЕсли;
		
		Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Установить(Истина);
		Результат = Истина;
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция НеобходимоЗавершитьЗаполнениеРеквизитаВидПродукцииИС() Экспорт
	
	ВедетсяУчетМаркируемойПродукции = ИнтеграцияИСМПВызовСервера.ВестиУчетМаркируемойПродукции();
	ЗаполнениеРеквизитаВидПродукцииИСВыполнено = Константы.ЗаполнениеРеквизитаВидПродукцииИСВыполнено.Получить();
	
	Возврат ВедетсяУчетМаркируемойПродукции И НЕ ЗаполнениеРеквизитаВидПродукцииИСВыполнено;
	
КонецФункции

#КонецОбласти
